; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v8 ?v7)
             (pred_7 ?v5 ?v3)
             (pred_12 ?v8 ?v3)
             (pred_1 ?v4 ?v8 )
	     (pred_8 ?v8)
             (pred_10 ?v13)
             (pred_11 ?v5)
             (pred_4 ?v3)
             (pred_5 ?v8)
             (pred_3 ?v5)
             (pred_2 ?v8)
             (pred_9 ))



(:action op_5
:parameters (?v11 ?v2 ?v9 ?v10)
:precondition (and (pred_10 ?v11) (pred_10 ?v2) (pred_11 ?v9) (pred_4 ?v10)
          (pred_6 ?v11 ?v2) (pred_7 ?v9 ?v10)
                   (pred_12 ?v2 ?v10) (pred_8 ?v11) 
                   (pred_5 ?v2) (pred_3 ?v9))
:effect (and  (pred_2 ?v2) (not (pred_5 ?v2))))


(:action op_4
:parameters (?v11 ?v6)
:precondition (and (pred_10 ?v11) (pred_10 ?v6)
               (pred_8 ?v11) (pred_6 ?v11 ?v6) (pred_2 ?v6))
:effect (and (pred_8 ?v6) (not (pred_8 ?v11))))

(:action op_1
:parameters (?v11 ?v9)
:precondition (and (pred_10 ?v11) (pred_11 ?v9) 
                  (pred_8 ?v11) (pred_1 ?v9 ?v11) (pred_9 ))
:effect (and (pred_3 ?v9)
   (not (pred_1 ?v9 ?v11)) (not (pred_9 ))))


(:action op_3
:parameters (?v11 ?v1 ?v12)
:precondition (and (pred_10 ?v11) (pred_11 ?v1) (pred_11 ?v12)
                  (pred_8 ?v11) (pred_3 ?v12) (pred_1 ?v1 ?v11))
:effect (and (pred_3 ?v1) (pred_1 ?v12 ?v11)
        (not (pred_3 ?v12)) (not (pred_1 ?v1 ?v11))))

(:action op_2
:parameters (?v11 ?v9)
:precondition (and (pred_10 ?v11) (pred_11 ?v9) 
                  (pred_8 ?v11) (pred_3 ?v9))
:effect (and (pred_9 ) (pred_1 ?v9 ?v11) (not (pred_3 ?v9)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_05 obj_09 obj_07 obj_04 obj_01 obj_12 obj_08 obj_10 obj_11
    obj_02 obj_03
    obj_06 obj_13
    )

    (:init
       (pred_9)

       (pred_10 obj_05)
       (pred_10 obj_09)
       (pred_10 obj_07)
       (pred_10 obj_04)
       (pred_10 obj_01)
       (pred_10 obj_12)
       (pred_10 obj_08)
       (pred_10 obj_10)
       (pred_10 obj_11)
       (pred_4 obj_02)
       (pred_4 obj_03)
       (pred_11 obj_06)
       (pred_11 obj_13)

       (pred_6 obj_05 obj_04)
       (pred_6 obj_05 obj_09)
       (pred_6 obj_09 obj_01)
       (pred_6 obj_09 obj_07)
       (pred_6 obj_09 obj_05)
       (pred_6 obj_07 obj_12)
       (pred_6 obj_07 obj_09)
       (pred_6 obj_04 obj_08)
       (pred_6 obj_04 obj_01)
       (pred_6 obj_04 obj_05)
       (pred_6 obj_01 obj_10)
       (pred_6 obj_01 obj_12)
       (pred_6 obj_01 obj_09)
       (pred_6 obj_01 obj_04)
       (pred_6 obj_12 obj_11)
       (pred_6 obj_12 obj_07)
       (pred_6 obj_12 obj_01)
       (pred_6 obj_08 obj_10)
       (pred_6 obj_08 obj_04)
       (pred_6 obj_10 obj_11)
       (pred_6 obj_10 obj_01)
       (pred_6 obj_10 obj_08)
       (pred_6 obj_11 obj_12)
       (pred_6 obj_11 obj_10)
       (pred_5 obj_04)
       (pred_5 obj_05)
       (pred_12  obj_04 obj_02)
       (pred_12  obj_05 obj_03)
       (pred_2 obj_09)
       (pred_2 obj_07)
       (pred_2 obj_01)
       (pred_2 obj_12)
       (pred_2 obj_08)
       (pred_2 obj_10)
       (pred_2 obj_11)

       (pred_7  obj_06 obj_02)
       (pred_7  obj_13 obj_03)
       (pred_1 obj_06 obj_01)
       (pred_1 obj_13 obj_08)
       (pred_8 obj_08)
    )

    (:goal (and
       (pred_1 obj_06 obj_11)
    ))
(:constraints
  (always (not (pred_8 obj_12)))
)
)

; plan
1. (op_4 obj_08 obj_10)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_10)
   goals met: 0 of 1
2. (op_4 obj_10 obj_01)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_01)
   goals met: 0 of 1
3. (op_1 obj_01 obj_06)
   deleted: (pred_1 obj_06 obj_01) (pred_9)
   added: (pred_3 obj_06)
   goals met: 0 of 1
4. (op_4 obj_01 obj_10)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_10)
   goals met: 0 of 1
5. (op_4 obj_10 obj_11)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_11)
   goals met: 0 of 1
6. (op_2 obj_11 obj_06)
   deleted: (pred_3 obj_06)
   added: (pred_9) (pred_1 obj_06 obj_11)
   goals met: 1 of 1
